import Image from "next/image";
import { useRouter } from "next/router";
import React from "react";

export default function Index() {
  const router = useRouter();
  return (
    <main className=" bg-gray-300 p-4 mt-14">
      <div className="md:w-[80%] mx-auto">
        <p className="font-bold text-xl ">
          بث مباشر لمبارات كرة القدم بين سبورت {router.query.id}
        </p>
        <p>
          مشاهدة بث مباشر مباراة مانشيستر يونايتد ضد سبيزيا على بين ماتش كورة
          شوت بث مباشر مباراة اشبيلية الاسباني و هيلاس فيرونا الإيطالي بتعليق
          رؤوف خليف التي تبث بواسطة قنوات beinsport تبث المباريات عبر كورة ستار
          و koawayk ويوجد ضمن فريق اتليتكو بيلباو الاسباني الكثير من الاعبين
          المميزين مثل ماركو ارناوتوفيتش وكان قد لعب ضمن اهم الفرق الايطالية
          ونال عدة جوائز الدوري الايطالي وتالق مع عدة اندية الانجليزية مثل باريس
          سان جيرمان الفرنسي و ريال بيتيس الاسباني و هوفنهايم الألماني و نانت
          الفرنسي و فولفسبورغ الألماني تابع بث مباشر لي كل ماتشات مانشيستر سيتي
          الانجليزي عبر جدول اهم مباريات اليوم على كورة لايف و beinmatch.
          <br />
          <br /> مباريات اليوم بث مباشر روما الايطالي و باير ليفركوزن الألماني
          بصوت رؤوف خليف على قنوات بين سبورت تبث المبارات عبر بين ماتش و
          beinmatch ويتوفر فريق اتليتكو بيلباو الاسباني الكثير من الاعبين
          المتالقين مثل اياغو اسباس بحيث لعب ضمن اهم الفرق الاوروبية وفاز بعدة
          القاب في الدوري الانجليزي الممتاز ولعب ضمن عدة فرق الانجليزية مثل
          ليفربول الانجليزي و كريستال بلاس الانجليزي و لانس الفرنسي و أجاكسيو
          الفرنسي و لاتسيو الإيطالي تابع بث مباشر لي كل ماتشات فالنسيا الاسباني
          على جدول اهم مباريات اليوم على king shot و koawayk
        </p>
        <div className="flex mt-3 justify-center">
          <Image src={"/banner1.jpg"} width={728} height={60} alt={"ads"} />
        </div>

        <div className="flex mt-3 justify-center">
          <Image src={"/banner1.jpg"} width={728} height={60} alt={"ads"} />
        </div>
        <p>
          كورة شوت بث مباشر مباراة تشيلسي الانجليزي و فرايبورغ عبر بين ماتش
          مشاهدة بث مباشر مباراة نابولي الايطالي ضد سيلتا فيغو الاسباني بصوت
          جواد بدة عبر قنوات بين سبورت تبث المباريات على كورة ستار و kora live
          ويوجد ضمن فريق اشبيلية الاسباني الكثير من الاعبين المميزين مثل حبيب
          ديالو الذي لعب ضمن اهم الفرق الاسبانية وفاز بعدة جوائز في الدوري
          الايطالي وتالق ضمن عدة اندية الفرنسية مثل اشبيلية الاسباني و هوفنهايم
          الألماني و كريستال بلاس الانجليزي و كريستال بلاس الانجليزي و موناكو
          الفرنسي ننقل كل مباريات نيوكاستل يونايتد الانجليزي على جدول ماتشات
          اليوم على بين ماتش و kora live بث مباشر مباراة اليوم انتر ميلان
          الايطالي و هيرتا برلين الألماني بصوت عصام شوالي التي تنقل بواسطة قنوات
          beinsport تبث المباريات عبر كورة لايف و koawayk ويوجد ضمن فريق توتنهام
          الانجليزي الكثير من الاعبين العالميين مثل داني إنغز وكان قد لعب ضمن
          اهم الفرق الانجليزية ونال عدة جوائز الدوري الانجليزي الممتاز وتالق ضمن
          عدة اندية الفرنسية مثل ريال مدريد الاسباني و سيلتا فيغو الاسباني و
          ليتشي الإيطالي و ريال سوسيداد الاسباني و أتالانتا الإيطالي استمتع
          بمشاهدة بث مباشر مباريات انتر ميلان الايطالي عبر جدول اهم مباريات
          اليوم على كورة لايف و korastar
        </p>
      </div>
    </main>
  );
}
